src/cf/Catalogs/ОфлайнОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОфлайнОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбработчикОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияБПО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторWebСервисОборудования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОфлайнОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОфлайнОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключенияОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключенияОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспортаОфлайнОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаОфлайнОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ОбработчикиОфлайнОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОбработчикиОфлайнОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СККМОфлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СЭвоторККМОфлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикАтолККМОфлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикШтрихМККМОфлайн</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработчик1СККМED</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбработчикОФД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ОфлайнОборудование/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФорм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СозданиеНовогоЭлемента = Объект.Ссылка = Справочники.ОфлайнОборудование.ПустаяСсылка();
	// Защита от изменения уже созданного экземпляра устройства.
	Элементы.ОбработчикОфлайнОборудования.ТолькоПросмотр = НЕ СозданиеНовогоЭлемента;
	Элементы.ОбработчикОфлайнОборудования.КнопкаОткрытия = Не СозданиеНовогоЭлемента;
	Элементы.ТипОборудования.ТолькоПросмотр = НЕ СозданиеНовогоЭлемента;
	Элементы.ТипОборудования.КнопкаОткрытия = Не СозданиеНовогоЭлемента;
	
	Если СозданиеНовогоЭлемента Тогда 
		Если ПустаяСтрока(Объект.РабочееМесто) Тогда
			Объект.РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
		КонецЕсли;
		Элементы.ПараметрыПодключения.Видимость = Ложь;
	КонецЕсли;
	
	ПроверкаПараметров = СозданиеНовогоЭлемента;
	
#Если МобильноеПриложениеСервер Тогда
	Элементы.РабочееМесто.Видимость = Ложь;
	Элементы.ПараметрыПодключения.Видимость = Ложь;
	Элементы.ТипПодключения.Видимость = Ложь;
#Иначе
	Если Объект.ТипПодключенияОборудования = Перечисления.ТипыПодключенияОборудования.ЛокальноеПодключение Тогда
		Элементы.РабочееМесто.Видимость = Истина;
	Иначе
		Элементы.РабочееМесто.Видимость = Ложь;
	КонецЕсли;
#КонецЕсли
	
	МенеджерОфлайнОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.Наименование);
	МенеджерОфлайнОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.РабочееМесто);
	МенеджерОфлайнОборудованияВызовСервера.ПодготовитьЭлементУправления(Элементы.ОбработчикОфлайнОборудования);
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПриСозданииНаСервере(Объект, ЭтотОбъект, Отказ, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПриЧтенииНаСервере(ТекущийОбъект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	МенеджерОфлайнОборудованияКлиентПереопределяемый.ЭкземплярОфлайнОборудованияПередЗаписью(Объект, ЭтотОбъект, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыУстройства = МенеджерОфлайнОборудованияВызовСервера.ПараметрыУстройства(Объект.Ссылка);
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МенеджерОфлайнОборудованияВызовСервераПереопределяемый.ЭкземплярОфлайнОборудованияОбработкаПроверкиЗаполненияНаСервере(Объект, ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СозданиеНовогоЭлемента = Ложь;
	
	Элементы.ПараметрыПодключения.Видимость = НЕ СозданиеНовогоЭлемента;
	
	МенеджерОфлайнОборудованияКлиентПереопределяемый.ЭкземплярОфлайнОборудованияПослеЗаписи(Объект, ЭтотОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПодключения(Команда)
	
	Если СозданиеНовогоЭлемента Или Модифицированность Тогда
		Если Записать() Тогда
			ПроверкаПараметров = Ложь;
			Закрыть();
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		ПроверкаПараметров = Ложь;
		Закрыть();
	КонецЕсли;
	
	МенеджерОфлайнОборудованияКлиент.ВыполнитьНастройкуОборудования(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	МенеджерОфлайнОборудованияКлиентПереопределяемый.ЭкземплярОфлайнОборудованияОбработкаНавигационнойСсылки(Объект, ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Если ПроверкаПараметров Тогда
			Отказ = Истина;
			Текст = НСтр("ru = 'Для использования устройства необходимо настроить параметры подключения.
			|Перейти к настройке параметров подключения?'");
			Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение",  ЭтотОбъект);
			ПоказатьВопрос(Оповещение, Текст, РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОбработчикОфлайнОборудованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Объект.ОбработчикОфлайнОборудования Тогда
		Объект.Наименование = НСтр("ru='Оборудование'") + " '" + Строка(ВыбранноеЗначение) + "'";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОборудованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Объект.ТипОфлайнОборудования <> ВыбранноеЗначение Тогда
		Объект.ТипОфлайнОборудования = ВыбранноеЗначение;
		Модифицированность = Истина;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	НастроитьДрайвераОфлайнОборудования();
	
	МенеджерОфлайнОборудованияКлиентПереопределяемый.ЭкземплярОфлайнОборудованияТипОборудованияВыбор(Объект, ЭтотОбъект, ЭтотОбъект, Элемент, ВыбранноеЗначение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Модифицированность Или СозданиеНовогоЭлемента Тогда
			Если Записать() Тогда
				ПроверкаПараметров = Ложь;
				Закрыть();
			Иначе
				Возврат;
			КонецЕсли;
		Иначе
			ПроверкаПараметров = Ложь;
			Закрыть();
		КонецЕсли;
		МенеджерОфлайнОборудованияКлиент.ВыполнитьНастройкуОборудования(Объект.Ссылка);
	Иначе
		ПроверкаПараметров = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДрайвераОфлайнОборудования()
	
	ТипККМ = Перечисления["ТипыОфлайнОборудования"].ККМ;
	ТипПрайсЧекер = Перечисления["ТипыОфлайнОборудования"].ПрайсЧекер;
	ТипОФД = Перечисления["ТипыОфлайнОборудования"].ОФД;
	Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Очистить();
	
	Если Объект.ТипОфлайнОборудования = ТипККМ Тогда
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.Обработчик1СККМОфлайн);
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.Обработчик1СЭвоторККМОфлайн);
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.ОбработчикАтолККМОфлайн);
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.ОбработчикШтрихМККМОфлайн);
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.Обработчик1СККМED);
	ИначеЕсли Объект.ТипОфлайнОборудования = ТипПрайсЧекер Тогда
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.Обработчик1СККМОфлайн);
	ИначеЕсли Объект.ТипОфлайнОборудования = ТипОФД Тогда
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Добавить(Перечисления.ОбработчикиОфлайнОборудования.ОбработчикОФД);
	Иначе
		Элементы.ОбработчикОфлайнОборудования.СписокВыбора.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
